rtzmicro/X24015_TivaTM4C1294NCPDT2/X24015_TM4C1294NCPDT.c
/*
 *  EMAC configuration structure
 *  Set user/company specific MAC octates. The following sets the address
 *  to ff-ff-ff-ff-ff-ff. Users need to change this to make the label on
 *  their boards.
 */
unsigned char macAddress[6] = {0xff, 0xff, 0xff, 0xff, 0xff, 0xff};

const EMACSnow_HWAttrs emacHWAttrs[X24015_EMACCOUNT] = {
    {
        .baseAddr    = EMAC0_BASE,
        .intNum      = INT_EMAC0,
        .intPriority = (~0),
        .macAddress  = macAddress
    }
};

const EMAC_Config EMAC_config[] = {
    {
        .fxnTablePtr = &EMACSnow_fxnTable,
        .object      = &emacObjects[0],
        .hwAttrs     = &emacHWAttrs[0]
    },
    {NULL, NULL, NULL}
};

/*
 *  ======== X24015_initEMAC ========
 */

/* Don't call Board_initEMAC() in main(). Instead call it in a task after you get the MAC address.
 *
 * You have a couple options to delay the starting of the NDK stack:
 * 1. Do not graphically generate it. Instead supply the thread yourself and start it after calling Board_initEMAC().
 * 2. Add a startup hook function into the stack via the .cfg file. Have that function block on a semaphore.
 * Post the semaphore after you call Board_initEMAC(). The hook is called very early in the stack thread,
 * well before the MAC address is referenced.
 *
 * .cfg file
 *  Global.stackBeginHook = "&myNDKStackBeginHook";
 *
 * .c file
 *  void myNDKStackBeginHook()
 *  {
 *      Semaphore_pend(mySem, BIOS_WAIT_FOREVER);
 *  }
 *
 */

void X24015_initEMAC(void)
{
    /* We use the MAC address from Atmel AT24 ID EPROM */
    memcpy(macAddress, g_sysData.ui8MAC, 6);

#if 0
    uint32_t ulUser0, ulUser1;

    /* Get the MAC address */
    FlashUserGet(&ulUser0, &ulUser1);
    if ((ulUser0 != 0xffffffff) && (ulUser1 != 0xffffffff)) {
        System_printf("Using MAC address in flash\n");
        /*
         *  Convert the 24/24 split MAC address from NV ram into a 32/16 split MAC
         *  address needed to program the hardware registers, then program the MAC
         *  address into the Ethernet Controller registers.
         */
        macAddress[0] = ((ulUser0 >>  0) & 0xff);
        macAddress[1] = ((ulUser0 >>  8) & 0xff);
        macAddress[2] = ((ulUser0 >> 16) & 0xff);
        macAddress[3] = ((ulUser1 >>  0) & 0xff);
        macAddress[4] = ((ulUser1 >>  8) & 0xff);
        macAddress[5] = ((ulUser1 >> 16) & 0xff);
    }
    else if (macAddress[0] == 0xff && macAddress[1] == 0xff &&
             macAddress[2] == 0xff && macAddress[3] == 0xff &&
             macAddress[4] == 0xff && macAddress[5] == 0xff) {
        System_abort("Change the macAddress variable to match your boards MAC sticker");
    }
#endif
    // Enable peripheral EPHY0
    SysCtlPeripheralEnable(SYSCTL_PERIPH_EPHY0);

    GPIOPinConfigure(GPIO_PF0_EN0LED0);  /* X24015_J5 YEL */
    GPIOPinTypeEthernetLED(GPIO_PORTF_BASE, GPIO_PIN_0);

    GPIOPinConfigure(GPIO_PK6_EN0LED1);  /* X24015_J5_GRN */
    GPIOPinTypeEthernetLED(GPIO_PORTK_BASE, GPIO_PIN_6);

    /* Once EMAC_init is called, EMAC_config cannot be changed */
    EMAC_init();
}

/*
 *  =============================== GPIO ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(GPIOTiva_config, ".const:GPIOTiva_config")
#endif

#include <ti/drivers/GPIO.h>
#include <ti/drivers/gpio/GPIOTiva.h>

/*
 * Array of Pin configurations
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in X24015_TM4C1294NCPDT.h
 * NOTE: Pins not used for interrupts should be placed at the end of the
 *       array.  Callback entries can be omitted from callbacks array to
 *       reduce memory usage.
 */
GPIO_PinConfig gpioPinConfigs[] = {
    /* Input Interrupt pins */
    /* X24015_GPIO_PF4 */
    GPIOTiva_PF_4 | GPIO_CFG_IN_PU,
    /* X24015_GPIO_PL5 */
    GPIOTiva_PL_5 | GPIO_CFG_IN_PU,
    /* X24015_GPIO_PL4 */
    GPIOTiva_PL_4 | GPIO_CFG_IN_PU,
    /* X24015_GPIO_PL2 */
    GPIOTiva_PL_2 | GPIO_CFG_IN_PU,
    /* X24015_GPIO_PL3 */
    GPIOTiva_PL_3 | GPIO_CFG_IN_PU,
    /* X24015_GPIO_PN0 */
    GPIOTiva_PN_0 | GPIO_CFG_IN_PU,
    /* X24015_GPIO_PN1 */
    GPIOTiva_PN_1 | GPIO_CFG_IN_PU,
    /* X24015_GPIO_PN2 */
    GPIOTiva_PN_2 | GPIO_CFG_IN_PU,
    /* X24015_GPIO_PN5 */
    GPIOTiva_PN_5 | GPIO_CFG_IN_PU,
    /* X24015_GPIO_PN3 */
    GPIOTiva_PN_3 | GPIO_CFG_IN_PU,
    /* X24015_GPIO_PN4 */
    GPIOTiva_PN_4 | GPIO_CFG_IN_PU,

    /* Output pins */
    /* X24015_GPIO_PH3 */
    GPIOTiva_PH_3 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_LOW,
    /* X24015_GPIO_PH2 */
    GPIOTiva_PH_2 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_LOW,
    /* X24015_GPIO_PK7 */
    GPIOTiva_PK_7 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_LOW,
    /* X24015_GPIO_PM0 */
    GPIOTiva_PM_0 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_LOW,
    /* X24015_GPIO_PM1 */
    GPIOTiva_PM_1 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_LOW,
    /* X24015_GPIO_PM2 */
    GPIOTiva_PM_2 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_LOW,
    /* X24015_GPIO_PM3 */
    GPIOTiva_PM_3 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_LOW,
    /* X24015_GPIO_PP3 */
    GPIOTiva_PP_3 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_LOW,
    /* X24015_GPIO_PP2 */
    GPIOTiva_PP_2 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_LOW,
    /* X24015_GPIO_PQ4 */
    GPIOTiva_PQ_4 | GPIO_CFG_OUT_STD | GPIO_CFG_OUT_LOW,
};

/*
 * Array of callback function pointers
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in X24015_TM4C1294NCPDT.h
 * NOTE: Pins not used for interrupts can be omitted from callbacks array to
 *       reduce memory usage (if placed at end of gpioPinConfigs array).
 */
GPIO_CallbackFxn gpioCallbackFunctions[] = {
    NULL,   /* X24015_GPIO_PF4 */
    NULL,   /* X24015_GPIO_PL5 */
    NULL,   /* X24015_GPIO_PL4 */
    NULL,   /* X24015_GPIO_PL2 */
    NULL,   /* X24015_GPIO_PL3 */
    NULL,   /* X24015_GPIO_PN0 */
    NULL,   /* X24015_GPIO_PN1 */
    NULL,   /* X24015_GPIO_PN2 */
    NULL,   /* X24015_GPIO_PN5 */
    NULL,   /* X24015_GPIO_PN3 */
    NULL,   /* X24015_GPIO_PN4 */
};

