rtzmicro/X24015_TivaTM4C1294NCPDT2/X24015_TM4C1294NCPDT.c
/* The device-specific GPIO_config structure */
const GPIOTiva_Config GPIOTiva_config = {
    .pinConfigs         = (GPIO_PinConfig *)gpioPinConfigs,
    .callbacks          = (GPIO_CallbackFxn *)gpioCallbackFunctions,
    .numberOfPinConfigs = sizeof(gpioPinConfigs)/sizeof(GPIO_PinConfig),
    .numberOfCallbacks  = sizeof(gpioCallbackFunctions)/sizeof(GPIO_CallbackFxn),
    .intPriority        = (~0)
};

/*
 *  ======== X24015_initGPIO ========
 */
void X24015_initGPIO(void)
{
    // Enable pin PF4 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTF_BASE, GPIO_PIN_4);
    // Enable pin PL5 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTL_BASE, GPIO_PIN_5);
    // Enable pin PL4 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTL_BASE, GPIO_PIN_4);
    // Enable pin PL2 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTL_BASE, GPIO_PIN_2);
    // Enable pin PL3 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTL_BASE, GPIO_PIN_3);
    // Enable pin PN0 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTN_BASE, GPIO_PIN_0);
    // Enable pin PN1 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTN_BASE, GPIO_PIN_1);
    // Enable pin PN2 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTN_BASE, GPIO_PIN_2);
    // Enable pin PN5 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTN_BASE, GPIO_PIN_5);
    // Enable pin PN3 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTN_BASE, GPIO_PIN_3);
    // Enable pin PN4 for GPIOInput
    GPIOPinTypeGPIOInput(GPIO_PORTN_BASE, GPIO_PIN_4);

    // Enable pin PH3 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTH_BASE, GPIO_PIN_3);
    // Enable pin PH2 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTH_BASE, GPIO_PIN_2);
    // Enable pin PK7 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTK_BASE, GPIO_PIN_7);
    // Enable pin PM0 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTM_BASE, GPIO_PIN_0);
    // Enable pin PM1 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTM_BASE, GPIO_PIN_1);
    // Enable pin PM2 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTM_BASE, GPIO_PIN_2);
    // Enable pin PM3 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTM_BASE, GPIO_PIN_3);
    // Enable pin PP3 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTP_BASE, GPIO_PIN_3);
    // Enable pin PP2 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTP_BASE, GPIO_PIN_2);
    // Enable pin PQ4 for GPIOOutput
    GPIOPinTypeGPIOOutput(GPIO_PORTQ_BASE, GPIO_PIN_4);

    /* Once GPIO_init is called, GPIO_config cannot be changed */
    GPIO_init();
}

/*
 *  =============================== I2C ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(I2C_config, ".const:I2C_config")
#pragma DATA_SECTION(i2cTivaHWAttrs, ".const:i2cTivaHWAttrs")
#endif

#include <ti/drivers/I2C.h>
#include <ti/drivers/i2c/I2CTiva.h>

I2CTiva_Object i2cTivaObjects[X24015_I2CCOUNT];

const I2CTiva_HWAttrs i2cTivaHWAttrs[X24015_I2CCOUNT] = {
    {
        .baseAddr    = I2C0_BASE,
        .intNum      = INT_I2C0,
        .intPriority = (~0)
    },
    {
        .baseAddr    = I2C1_BASE,
        .intNum      = INT_I2C1,
        .intPriority = (~0)
    },
    {
        .baseAddr    = I2C2_BASE,
        .intNum      = INT_I2C2,
        .intPriority = (~0)
    },
    {
        .baseAddr    = I2C3_BASE,
        .intNum      = INT_I2C3,
        .intPriority = (~0)
    }
};

const I2C_Config I2C_config[] = {
    {
        .fxnTablePtr = &I2CTiva_fxnTable,
        .object      = &i2cTivaObjects[0],
        .hwAttrs     = &i2cTivaHWAttrs[0]
    },
    {
        .fxnTablePtr = &I2CTiva_fxnTable,
        .object      = &i2cTivaObjects[1],
        .hwAttrs     = &i2cTivaHWAttrs[1]
    },
    {
        .fxnTablePtr = &I2CTiva_fxnTable,
        .object      = &i2cTivaObjects[2],
        .hwAttrs     = &i2cTivaHWAttrs[2]
    },
    {
        .fxnTablePtr = &I2CTiva_fxnTable,
        .object      = &i2cTivaObjects[3],
        .hwAttrs     = &i2cTivaHWAttrs[3]
    },
    {NULL, NULL, NULL}
};

/*
 *  ======== X24015_initI2C ========
 */
void X24015_initI2C(void)
{
    /* Enable the peripheral */
    SysCtlPeripheralEnable(SYSCTL_PERIPH_I2C0);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_I2C1);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_I2C2);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_I2C3);

    /* I2C0 Init */
    /* Configure the appropriate pins to be I2C instead of GPIO. */
    GPIOPinConfigure(GPIO_PB2_I2C0SCL);
    GPIOPinConfigure(GPIO_PB3_I2C0SDA);
    GPIOPinTypeI2CSCL(GPIO_PORTB_BASE, GPIO_PIN_2);
    GPIOPinTypeI2C(GPIO_PORTB_BASE, GPIO_PIN_3);

    /* I2C1 Init */
    /* Configure the appropriate pins to be I2C instead of GPIO. */
    GPIOPinConfigure(GPIO_PG0_I2C1SCL);
    GPIOPinConfigure(GPIO_PG1_I2C1SDA);
    GPIOPinTypeI2CSCL(GPIO_PORTG_BASE, GPIO_PIN_0);
    GPIOPinTypeI2C(GPIO_PORTG_BASE, GPIO_PIN_1);

    /* I2C2 Init */
    /* Configure the appropriate pins to be I2C instead of GPIO. */
    GPIOPinConfigure(GPIO_PL1_I2C2SCL);
    GPIOPinConfigure(GPIO_PL0_I2C2SDA);
    GPIOPinTypeI2CSCL(GPIO_PORTL_BASE, GPIO_PIN_1);
    GPIOPinTypeI2C(GPIO_PORTL_BASE, GPIO_PIN_0);

    /* I2C3 Init */
    /* Configure the appropriate pins to be I2C instead of GPIO. */
    GPIOPinConfigure(GPIO_PK4_I2C3SCL);
    GPIOPinConfigure(GPIO_PK5_I2C3SDA);
    GPIOPinTypeI2CSCL(GPIO_PORTK_BASE, GPIO_PIN_4);
    GPIOPinTypeI2C(GPIO_PORTK_BASE, GPIO_PIN_5);

    I2C_init();
}

/*
 *  =============================== PWM ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(PWM_config, ".const:PWM_config")
#pragma DATA_SECTION(pwmTivaHWAttrs, ".const:pwmTivaHWAttrs")
#endif

#include <ti/drivers/PWM.h>
#include <ti/drivers/pwm/PWMTiva.h>
#include <driverlib/pwm.h>

PWMTiva_Object pwmTivaObjects[X24015_PWMCOUNT];

const PWMTiva_HWAttrs pwmTivaHWAttrs[X24015_PWMCOUNT] = {
    {
        .baseAddr   = PWM0_BASE,
        .pwmOutput  = PWM_OUT_0,
        .pwmGenOpts = PWM_GEN_MODE_DOWN | PWM_GEN_MODE_DBG_RUN
    },
    {
        .baseAddr   = PWM0_BASE,
        .pwmOutput  = PWM_OUT_1,
        .pwmGenOpts = PWM_GEN_MODE_DOWN | PWM_GEN_MODE_DBG_RUN
    },
    {
        .baseAddr   = PWM0_BASE,
        .pwmOutput  = PWM_OUT_2,
        .pwmGenOpts = PWM_GEN_MODE_DOWN | PWM_GEN_MODE_DBG_RUN
    }
};

const PWM_Config PWM_config[] = {
    {
        .fxnTablePtr = &PWMTiva_fxnTable,
        .object      = &pwmTivaObjects[0],
        .hwAttrs     = &pwmTivaHWAttrs[0]
    },
    {
        .fxnTablePtr = &PWMTiva_fxnTable,
        .object      = &pwmTivaObjects[1],
        .hwAttrs     = &pwmTivaHWAttrs[1]
    },
    {
        .fxnTablePtr = &PWMTiva_fxnTable,
        .object      = &pwmTivaObjects[2],
        .hwAttrs     = &pwmTivaHWAttrs[2]
    },
    {NULL, NULL, NULL}
};

