rtzmicro/X24015_TivaTM4C1294NCPDT2/X24015_TM4C1294NCPDT.c
/*
 *  =============================== ADC ===============================
 */

void X24015_initADC(void)
{
    SysCtlPeripheralEnable(SYSCTL_PERIPH_ADC0);

    // Enable pin PE0 for ADC AIN3
    GPIOPinTypeADC(GPIO_PORTE_BASE, GPIO_PIN_0);
    // Enable pin PK2 for ADC AIN18
    GPIOPinTypeADC(GPIO_PORTK_BASE, GPIO_PIN_2);
    // Enable pin PK0 for ADC AIN16
    GPIOPinTypeADC(GPIO_PORTK_BASE, GPIO_PIN_0);
    // Enable pin PK1 for ADC AIN17
    GPIOPinTypeADC(GPIO_PORTK_BASE, GPIO_PIN_1);
    // Enable pin PE3 for ADC AIN0
    GPIOPinTypeADC(GPIO_PORTE_BASE, GPIO_PIN_3);
    // Enable pin PE1 for ADC AIN2
    GPIOPinTypeADC(GPIO_PORTE_BASE, GPIO_PIN_1);
    // Enable pin PE2 for ADC AIN1
    GPIOPinTypeADC(GPIO_PORTE_BASE, GPIO_PIN_2);
    // Enable pin PK3 for ADC AIN19
    GPIOPinTypeADC(GPIO_PORTK_BASE, GPIO_PIN_3);
}

/*
 *  ============================== TIMER ==============================
 */

void X24015_initTimers(void)
{
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER4);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER5);

    // Enable pin PM4 for TIMER4 T4CCP0
    GPIOPinConfigure(GPIO_PM4_T4CCP0);
    GPIOPinTypeTimer(GPIO_PORTM_BASE, GPIO_PIN_4);

    // Enable pin PM5 for TIMER4 T4CCP1
    GPIOPinConfigure(GPIO_PM5_T4CCP1);
    GPIOPinTypeTimer(GPIO_PORTM_BASE, GPIO_PIN_5);

    // Enable pin PM7 for TIMER5 T5CCP1
    GPIOPinConfigure(GPIO_PM7_T5CCP1);
    GPIOPinTypeTimer(GPIO_PORTM_BASE, GPIO_PIN_7);

    // Enable pin PM6 for TIMER5 T5CCP0
    GPIOPinConfigure(GPIO_PM6_T5CCP0);
    GPIOPinTypeTimer(GPIO_PORTM_BASE, GPIO_PIN_6);
}
